---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldOffsetX
source: html/2e7c2565-eccf-e2de-1c7e-1c35ebf80953.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".